Revit 2027 API
ExtensibleStorageFilter.SchemaGuid Property
 Schema id used to filter elements with extensible storage data
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid SchemaGuid { get; }
Public ReadOnly Property SchemaGuid As Guid
	Get
public:
property Guid SchemaGuid {
	Guid get ();
}
member SchemaGuid : Guid with get
Property Value
Guid
See Also
Reference
ExtensibleStorageFilter Class
Autodesk.Revit.DB.ExtensibleStorage Namespace